tap "derailed/k9s"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "remotemobprogramming/brew"
brew "adr-tools"
brew "asdf"
brew "awscli"
brew "bat"
brew "coreutils"
brew "curl"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "htop"
brew "jq"
brew "mas"
brew "ncdu"
brew "neovim"
brew "pgcli"
brew "pinentry-mac"
brew "ripgrep"
brew "siege"
brew "starship"
brew "telnet"
brew "travis"
brew "tree"
brew "unzip"
brew "vegeta"
brew "wget"
brew "yarn"
brew "z"
brew "zsh"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/vault"
brew "remotemobprogramming/brew/mob"
cask "appcleaner"
cask "authy"
cask "betterzip"
cask "charles"
cask "disk-inventory-x"
cask "dozer"
cask "font-fira-code"
cask "font-source-code-pro"
cask "fork"
cask "gas-mask"
cask "imageoptim"
cask "karabiner-elements"
cask "maccy"
cask "postman"
cask "rectangle"
cask "spotify"
cask "transmission"
cask "tunnelblick"
cask "vlc"
cask "whatsapp"

mas "1Password 7", id: 1333542190
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Minimal Consent", id: 1514164630
mas "NextDNS", id: 1464122853
mas "Stockfish", id: 801463932
